// var num = 1;
// while(num < 10){
//     console.log(num);
//     num++;
// }


// এতক্ষন যতগুলো কোড করলাম সবই ১-১০ পর‌্যন্ত গেল এখন আমি চাচ্ছি ১-১০ পর্যন্ত না গিয়ে ১০-১ এ নেমে আসুক 
var num = 10;

// এখানে ১ এর বড় অথবা সমান বুঝানো হয়েছে 
while(num >= 1){
    console.log(num);

    // এখানে সংখ্যাগুলোকে ১ করে কমাবে । ১০ থেকে ৯ এ আসবে । 
    num--;
}


// এখানে স্বাভাবিক ভাবে ১-১০ পর‌্যন্ত চলবে । 
for(var i = 1; i <= 10; i++){
    console.log(i);
}



// এখানে ১০-১ পর‌্যন্ত সংখ্যাগুলো আসবে 
for(var i = 10; i >= 1; i--){
    console.log(i);
}


