/* 

*/

//1. feet to inch = এটা বের করতে হবে । 
feetToInch ফাংশনের নামটা হুবাহু এরকমের হতে হবে ।


// 2. centimeter to miter 
centimeterToMiter এটা ফাংশনের নাম


// 3. count paper 
book1 ----> 100  ১টা বইয়ের জন্য পাতা লাগে ১০০ টা 
book2 ----> 200 
book3 ----> 300 

আমার বের করতে হবে যে নিচের ফাংশনে (২, ৫, ৭) বইয়ের জন্য কতগুলো পৃষ্ঠা লাগবে ।
paperRequirments 

// 4. নিচের নামগুলো থেকে সবচেয়ে বড় নামটা বের করো 
['sajid', 'mamun', 'kawser', 'rasduzzamanrakib'] 
bestFriend 


// 5. নিচের অ্যারে থেকে নেগেটিভ সংখ্যা পাওয়া মাত্র অ্যারে অফ করে দিতে হবে এবং নেগেটিভ সংখ্যার আগ পর্যন্ত সংখ্যাগুলো রেজাল্ট দিয়ে দিবো । 
[45, 87, 96, 11, 63, -56, 71, 28]; 
onlyPositive 