/***
 * 
 *  @@@@@@@@@@@@@@@@@@@@@ "1" ELEMENTS OF A UNIQUE PROJECT START   @@@@@@@@@@@@@@@@@@@@
 * 
 * 1. Project Idea => আমি কি ধরনের প্রজেক্ট করতে চাই । তার আইডিয়া তৈরি করা ।
 * 2. Features => প্রজেক্টের বৈশিষ্ট্য কেমন হবে । 
 * 3. Major Tech => আমি কি ধরনের টেকনোলজি ইউজ করবো । যেমন, React
 * 4. Libraries  => কোন ধরনের ফ্রেমওয়ার্ক লাইব্রেরি ইউজ করবো ।
 * 5. Challenge => যেই জিনিসটা আমি শিখি নি । প্রজেক্টে নতুন কোনো জিনিস চ্যালেন্জ নিয়ে করার চেস্টা করা । 
 * 6. Design => অবশ্যই প্রজেক্টের ডিজাইনটা ইউনিক হতে হবে । মানি দেখার সৌন্দার‌্য বলে একটা কথা তো আছে । 
 * 
 * 
 *  @@@@@@@@@@@@@@@@@@@@@ "1" ELEMENTS OF A UNIQUE PROJECT END   @@@@@@@@@@@@@@@@@@@@
 * 
 * 
 * 
 * 
 *  @@@@@@@@@@@@@@@@@@@@@ "2" কোর্সের পাশাপাশি আমার কি কি করা উচিৎ  @@@@@@@@@@@@@@@@@@@@
 * 
 * 
 * ১. Hobby side projects => শখ করে প্রজেক্ট তৈরি করা 
 * ২. রেগুলার গিটহাবটা অ্যাকটিভ রাখা মানি গিটহাবে রেগুলার কোড পুস করার চেস্টা করা । 
 * ৩. প্রবলেম সলবিং করা ।
 * ৪. ইউটুউবে নিজের কাজ সম্পর্কে ভিডিও বানানো দরকার হলে একা একা দেখা 
 * ৫. অন্যকে নিজের কাজটা বুঝিয়ে দেয়ার চেস্টা করা । 
 * ৬. সোসাল মিডিয়াতে ওয়েব রিলেটেড সকল গ্রুপের সাথে অ্যাকটিভ থাকা 
 * ৭. নিজের পার্সোনাল নেটওয়ার্ট তৈরি করা । একাধিক লোকের সাথে কানেক্ট থাকা ।
 *  
 * 
 *  @@@@@@@@@@@@@@@@@@@@@ "2" কোর্সের পাশাপাশি আমার কি কি করা উচিৎ  @@@@@@@@@@@@@@@@@@@@
 * 
 * 
 * 
 * 
 * 
 */